andrecurvello/RX63N-Collection/RTC/r_rtc_rx/src/r_rtc_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_rtc_rx.c
* Description  : Main driver code for the Real Time Clock (RTC) peripheral on RX MCUs.
************************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           09.09.2013 1.00    First release.
*           16.04.2014 2.00    Updated for new API.
*           03.09.2014 2.10    Added support for RX64M.
*           03.12.2014 2.20    Added support for RX113.
*           22.01.2015 2.30    Added support for RX71M.
*           06.07.2015 2.40    Added support for RX231.
*           01.03.2016 2.41    Added support for RX130.
*                              Added support for RX230.
*                              Added the rtc_enable_ints function in order to enable the interrupt
*                              regardless of the cold start or warm start.
*           01.10.2016 2.50    Added support for RX65N.
*                              Change the range of values that can be set in the  interrupt priority level.
*                              (Can set value of '0')
*                              Change the specification for the registration of the callback function.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "platform.h"
#include "r_rtc_rx_if.h"
#include "r_rtc_rx_config.h"
#include "r_rtc_rx_private.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

/* Control block for RTC */
static rtc_ctrl_t rcb = {false, FIT_NO_FUNC};

#if (RTC_CFG_PARAM_CHECKING_ENABLE)
static rtc_err_t rtc_check_periodic(rtc_periodic_t freq, uint8_t priority, rtc_cb_func_t p_callback);
static bool check_valid_time(tm_t * p_time);
#endif

static bool leap_year_test(int curr_year);

/* Number of days in month. */
const uint8_t   g_days_in_month[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};


/***********************************************************************************************************************
* Function Name: R_RTC_Open
* Description  : Sets the current date/time, starts the counters, and configures the output clock
*                and periodic interrupt options. This module is locked to avoid re-entrancy issues.
* Arguments    : p_init
*                   - pointer to initialization structure
* Return Value : RTC_SUCCESS
*                   - RTC successfully initialized
*                RTC_ERR_ALREADY_OPEN
*                   - RTC initialized previously
*                RTC_ERR_MISSING_CALLBACK
*                   - Periodic interrupts specified but no corresponding callback supplied.
*                RTC_ERR_BAD_PARAM
*                   - Missing or invalid parameter
*                RTC_ERR_TIME_FORMAT
*                   - A field within p_current has an invalid value
*                       RTC_SUCCESS = 0,
***********************************************************************************************************************/
rtc_err_t R_RTC_Open (rtc_init_t * p_init, tm_t *p_current)
{
    rtc_err_t err=RTC_SUCCESS;

    /* Prevent multiple initialization */
    if (R_BSP_HardwareLock(BSP_LOCK_RTC) == false)
    {
        return RTC_ERR_ALREADY_OPEN;
    }

#if (RTC_CFG_PARAM_CHECKING_ENABLE)
    /* Check input values. */
    if ((FIT_NO_PTR == p_init) || (NULL == p_init)
     || (p_init->output_freq >= RTC_OUTPUT_END_ENUM))
    {
        R_BSP_HardwareUnlock(BSP_LOCK_RTC);
        return RTC_ERR_BAD_PARAM;
    }

    err = rtc_check_periodic(p_init->periodic_freq, p_init->periodic_priority, p_init->p_callback);
    if (RTC_SUCCESS != err)
    {
        R_BSP_HardwareUnlock(BSP_LOCK_RTC);
        return err;
    }

    if (true == p_init->set_time)
    {
        if ((FIT_NO_PTR == p_current) || (NULL == p_current))
        {
            err = RTC_ERR_BAD_PARAM;
        }
        else if (!check_valid_time(p_current))
        {
            err = RTC_ERR_TIME_FORMAT;
        }
        else
        {
            /* nothing to do */
        }

        if (RTC_SUCCESS != err)
        {
            R_BSP_HardwareUnlock(BSP_LOCK_RTC);
            return err;
        }
    }
#endif

    /* Set the current time if specified (implied cold start) */
    if (true == p_init->set_time)
    {
        rtc_init();
        rtc_set_current_time(p_current);
    }

